#include <stdio.h> 

int main(){
	printf("----------------------------------------------------\n");
	printf("优先级第一级排名:\n");
	printf("[]  ()  .  ->  变量++  变量--\n");
	printf("----------------------------------------------------\n");
	printf("优先级第二级排名:\n");
	printf("-  类型强制  ++变量  --变量  *  &  !  ~  sizeof\n");
	printf("----------------------------------------------------\n");
	printf("优先级第三级排名:\n");
	printf("/  *  %\n");
	printf("----------------------------------------------------\n");
	printf("优先级第四级排名:\n");
	printf("+  -\n");
	printf("----------------------------------------------------\n");
	printf("优先级第五级排名:\n");
	printf("<<  >>\n");
	printf("----------------------------------------------------\n");
	printf("优先级第六级排名:\n");
	printf(">  >=  <  <=\n");
	printf("----------------------------------------------------\n");
	printf("优先级第七级排名:\n");
	printf("==  !=\n");
	printf("----------------------------------------------------\n"); 
	printf("优先级往后排名:\n");
	printf("&  ^  |  &&  ||  ?:\n");
	printf("----------------------------------------------------\n");
	printf("优先级往后排名:\n");
	printf("各种增强运算符!\n");
	printf("----------------------------------------------------\n");
	printf("最低级的运算符是:逗号\n");
	return 0;
} 
